src/ai-operator/InformationRegisters/ИИО_РазрешенияДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИИО_РазрешенияДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разрешено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ai-operator/CommonModules/ИИО_Права/Ext/Module.bsl
// Права на действия ИИ-оператора: разрешения администратора в регистре ИИО_РазрешенияДействий
// и права платформы на объекты. Функции принимают пользователя параметром, чтобы их можно было проверить тестами.

#Область СлужебныйПрограммныйИнтерфейс

// Разрешено ли действие пользователю в регистре ИИО_РазрешенияДействий. Запись на пользователя важнее записей
// на его группы; среди групп достаточно одной с разрешением. Нет записей - действие запрещено.
//
// Параметры:
//  Действие - Строка - Код действия: post, unpost или действие пакета (см. РазрешаемыеДействия).
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - По умолчанию текущий пользователь.
//
// Возвращаемое значение:
//  Булево
Функция ДействиеРазрешено(Действие, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	// Настройки читаются в привилегированном режиме: у пользователя нет прав на регистр разрешений
	// и составы групп пользователей.
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТПользовательИГруппы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставыГрупп.ГруппаПользователей
	|ИЗ
	|	РегистрСведений.СоставыГруппПользователей КАК СоставыГрупп
	|ГДЕ
	|	СоставыГрупп.Пользователь = &Пользователь
	|	И СоставыГрупп.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Разрешения.Разрешено КАК Разрешено,
	|	ВЫБОР
	|		КОГДА Разрешения.Пользователь = &Пользователь
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	РегистрСведений.ИИО_РазрешенияДействий КАК Разрешения
	|ГДЕ
	|	Разрешения.Пользователь В
	|			(ВЫБРАТЬ
	|				ПользовательИГруппы.Пользователь
	|			ИЗ
	|				ВТПользовательИГруппы КАК ПользовательИГруппы)
	|	И Разрешения.Действие = &Действие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Разрешено УБЫВ";
	Запрос.УстановитьПараметр("Действие", Действие);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Выборка.Следующий() И Выборка.Разрешено;

КонецФункции

// Ошибка для модели, если пользователь не может выполнить действие над объектами этих видов:
// нет разрешения администратора ИИ-оператора или права платформы.
//
// Параметры:
//  Описание - см. ИИО_Действия.НовоеДействие
//  ОбъектыМетаданных - Массив из ОбъектМетаданных
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - По умолчанию текущий пользователь.
//  ПользовательИБ - ПользовательИнформационнойБазы, Неопределено - Для проверки прав платформы,
//    по умолчанию текущий пользователь.
//
// Возвращаемое значение:
//  Структура - Ошибка ACTION_DENIED.
//  Неопределено - Действие доступно.
Функция ОшибкаДоступаКДействию(Описание, ОбъектыМетаданных, Пользователь = Неопределено,
	ПользовательИБ = Неопределено) Экспорт

	Если Не ДействиеРазрешено(Описание.Код, Пользователь) Тогда
		Возврат ИИО_ОтветКлиентСервер.Ошибка("ACTION_DENIED",
			СтрШаблон(НСтр("ru = 'Действие «%1» (%2) не разрешено этому пользователю в настройках ИИ-оператора.'"),
				Описание.Представление, Описание.Код),
			НСтр("ru = 'Скажи пользователю, что разрешение выдает администратор 1С: «ИИ-оператор» → «Настройки ИИ-оператора» → «Разрешенные действия». Не пытайся выполнить изменение другим способом.'"));
	КонецЕсли;

	Для Каждого ОбъектМетаданных Из ОбъектыМетаданных Цикл
		Если ПользовательИБ = Неопределено Тогда
			ЕстьПраво = ПравоДоступа(Описание.Право, ОбъектМетаданных);
		Иначе
			ЕстьПраво = ПравоДоступа(Описание.Право, ОбъектМетаданных, ПользовательИБ);
		КонецЕсли;
		Если Не ЕстьПраво Тогда
			Возврат ИИО_ОтветКлиентСервер.Ошибка("ACTION_DENIED",
				СтрШаблон(НСтр("ru = 'У пользователя нет права «%1» для «%2».'"),
					Описание.ПредставлениеПрава, ОбъектМетаданных.Представление()),
				НСтр("ru = 'Скажи пользователю, что права выдает администратор 1С в профиле группы доступа. Не пытайся выполнить изменение другим способом.'"));
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции

// Действия, которые администратор ИИ-оператора может разрешить в регистре ИИО_РазрешенияДействий: действия ядра
// (ИИО_Действия) и действия пакетов (ПриРегистрацииРазрешений, см. ИИО_Пакеты). Код пакета, совпавший с уже
// зарегистрированным, пропускается: пакет не может подменить действие ядра. Сбой пакета пишется в журнал регистрации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - Код действия.
//   * Значение - Строка - Представление для администратора.
Функция РазрешаемыеДействия() Экспорт

	Результат = Новый Соответствие;
	Для Каждого КлючИЗначение Из ИИО_Действия.Действия() Цикл
		Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Представление);
	КонецЦикла;
	Для Каждого ИмяМодуля Из ИИО_Пакеты.СерверныеМодули() Цикл
		Разрешения = Новый Соответствие;
		Попытка
			ОбщегоНазначения.ОбщийМодуль(ИмяМодуля).ПриРегистрацииРазрешений(Разрешения);
		Исключение
			ИИО_ЖурналВызовСервера.ЗаписатьОшибкуПакета(ИмяМодуля,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
		Для Каждого КлючИЗначение Из Разрешения Цикл
			Если Результат.Получить(КлючИЗначение.Ключ) <> Неопределено Тогда
				ИИО_ЖурналВызовСервера.ЗаписатьОшибкуПакета(ИмяМодуля,
					СтрШаблон(НСтр("ru = 'Действие %1 уже зарегистрировано ядром или другим пакетом.'"),
						КлючИЗначение.Ключ));
				Продолжить;
			КонецЕсли;
			Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Может ли пользователь информационной базы работать с ИИ-оператором: правило то же, что у
// ИИО_ПраваВызовСервера.ДоступенИИОператор, но для любого пользователя. Личный бот канала есть
// только у тех, кому доступен ИИ-оператор. Права другого пользователя проверяются в привилегированном режиме.
//
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы
//
// Возвращаемое значение:
//  Булево
Функция ДоступенИИОператорПользователю(ПользовательИБ) Экспорт

	Возврат ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.ИИО_ЗапуститьИИОператор, ПользовательИБ)
		Или Пользователи.ЭтоПолноправныйПользователь(ПользовательИБ);

КонецФункции

// Администратор ИИ-оператора видит пакеты всех пользователей и откатывает любые пакеты. Признак - право
// изменять разрешения действий: его дают роли администратора ИИ-оператора и ИИО_ПолныеПрава.
//
// Возвращаемое значение:
//  Булево
Функция ЭтоАдминистраторИИОператора() Экспорт

	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ИИО_РазрешенияДействий)
		Или Пользователи.ЭтоПолноправныйПользователь();

КонецФункции

#КонецОбласти
